brew 'jq'
brew 'vim', args={'--with-lua': true}
brew 'htop'
brew 'fzf'
brew 'fish'
brew 'ripgrep'
brew 'tmux'
brew 'bat'
# brew 'rbenv'
brew 'nvm'

# This doesn't seem to work anymore
# Brave
# cask 'brave-browser'
# ITerm
cask 'iterm2'
cask 'keeweb'
# cask 'visual-studio-code'
# An app to unify all your messengers.
cask 'rambox'
# Spaced repetition ftw.
# cask 'anki'
# change system wide shortcuts
cask 'karabiner-elements'
# move windows around
cask 'rectangle'
# improve alt-tab functionality
# it got slow with recent OS X version, holding this off for a while
# cask 'alt-tab'
# cask 'notion'
# Raycast - an alternative command palette
cask 'raycast'
