tap 'homebrew/bundle'

brew 'jq'
brew 'vim', args={'--with-lua': true}
brew 'tree'
brew 'htop'
brew 'fzf'
brew 'fish'
brew 'git-cola'
brew 'ripgrep'
brew 'tmux'
brew 'bat'
brew 'rbenv'
brew 'nvm'
brew 'exa'
brew 'bat'

# Brave
cask 'brave-browser'
# ITerm
cask 'iterm2'
cask 'keeweb'
cask 'visual-studio-code'
cask 'rambox'
cask 'anki'
# change system wide shortcuts
cask 'karabiner-elements'
# show some performance indicators
cask 'iglance'
# move windows around
cask 'rectangle'
# improve alt-tab functionality
cask 'alt-tab'
cask 'notion'
# install Python management tool
cask 'miniconda'
# Raycast - an alternative command palette
cask 'raycast'