# Must brews
brew 'fish'
brew 'fzf'
brew 'bat'
brew 'ripgrep'

# Dev Tools
brew 'vim', args={'--with-lua': true}
brew 'tmux'
brew 'htop'
brew 'jq'
brew 'yq'
brew 'nvm'

## Zsh
brew 'zsh-syntax-highlighting'

# Must casks
# change system wide shortcuts
cask 'brave-browser'
cask 'karabiner-elements'
cask 'rectangle'
cask 'iterm2'
cask 'warp'
cask 'cursor'

# Other tools
cask 'keeweb'
# An app to unify all your messengers.
cask 'rambox'
cask 'anki'
cask 'notion'
# Raycast - an alternative command palette
cask 'raycast'

# Experiments
brew 'git-spice'

# Graveyard
# improve alt-tab functionality
# it got slow with recent OS X version, holding this off for a while
# cask 'alt-tab'
# cask 'arc'